Com base no dataset anterior:

In [3]:
import pandas as pd
import numpy as np

In [4]:
dados = np.random.randint(1,50,16,).reshape((4,4))
index = ['Ano '+str(i) for i in range(1,5)]
col = ['Marca '+chr(65+i) for i in range(4)]
df = pd.DataFrame(dados, columns = col, index= index )
df

       Marca A  Marca B  Marca C  Marca D
Ano 1       40        7       29       27
Ano 2       15       43       30        4
Ano 3       19       29       17       22
Ano 4       20       34       29        5

a) crie uma coluna para a 'Marca E', que registrou os seguintes lucros para os respectivos anos: 70, 77, 81, 103;

In [6]:
df['Marca E'] = [70, 77, 81, 103]
df

       Marca A  Marca B  Marca C  Marca D  Marca E
Ano 1       40        7       29       27       70
Ano 2       15       43       30        4       77
Ano 3       19       29       17       22       81
Ano 4       20       34       29        5      103

b) renomeie o nome das colunas para, respectivamente: 'A', 'B','C', 'D', 'E';

In [7]:
df.rename(
    columns = {
        'Marca A': 'A',
        'Marca B': 'B',
        'Marca C': 'C',
        'Marca D': 'D',
        'Marca E': 'E'
    }, inplace = True)

c) renomeie o índice do DataFrame para respectivamente: 'ANO 1', 'ANO 2', 'ANO 3', 'ANO 4';

In [8]:
df.rename(index = lambda coluna:coluna.upper(), inplace = True)

d) substitua o valor do lucro da 'Marca C' ('C' na nova notação) no ANO 2 de 40 para 37.

In [ ]:
df.at['ANO 2', 'C'] = 37